tobiaslenz1988/OilLevelTempSensor_GC9A01_3_0_ESP32_S3/uds_statemachine_common.cpp
#include "esp32-hal.h"
#include <Arduino.h>
#include <stdio.h>
#include <string.h>
#include <Preferences.h>
#include "uds_statemachine_common.h"
#include "bus_common.h"
#include "oilsensor.h"
#include "nrc_uds_protocol.h"
#include "brand_defines_common.h"
#include "softwareversion.h"
#include "sensors/sensors.h"
#include "dtc_oilsensor.h"


extern Preferences preferences;

extern uint8_t session;
extern String oemPartNumberOilTempSensor;
extern String supplierPartNumberOilTempSensor;
extern String oemPartNumberWaterTempSensor;
extern String supplierPartNumberWaterTempSensor;
extern String HWModelleName;


void delete_BT_buffer(void) { /*
  for(int z=0;z<Buffersize;z++)
  {
    BT_rx_buffer[z]=0xFF;  
  }*/
}

void analyse_BT_Protocol(char receive_BT_Array[]) {
  //Serial.println(receive_BT_Array[]);
  if (NewData == true) {
    /*Command to read something*/
      if (receive_BT_Array[0] == UDS_READ_DATA_BY_IDENTIFIER) {
        uint8_t posResponse = (UDS_READ_DATA_BY_IDENTIFIER + 0x40);
          /* 0x22 0xF1 0xAB */
          /* Get SW Version*/
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0xAB)) {
            uint8_t data[3];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0xAB;
            data[3]=(uint8_t)SOFTWAREVERSION[0];
            data[4]=(uint8_t)SOFTWAREVERSION[1];
            data[5]=(uint8_t)SOFTWAREVERSION[2];
            data[6]=(uint8_t)SOFTWAREVERSION[3];
            BUS_output(data, 7);
          } else

          /* 0x22 0xF1 0x86 */
          /* Get actual Sesion */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x86)) {
            uint8_t data[4];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x86;
            data[3] = session;
            BUS_output(data, 4);
          } else

          /* 0x22 0xF1 0x90 */
          /* Get Name of Central Chip */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x90)) {
            uint8_t i = 0;
            while (HWModelleName[i] != '-') {
              i = i + 1;
            }
            uint8_t len = 3+i;
            uint8_t data[len];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x90;
            for(int i=0;i<len;i++)
            {
              data[3+i] = (uint8_t)HWModelleName[i];
            }
            BUS_output(data, len);
          } else

          /* 0x22 0xF1 0x91 */
          /* Get VWPartNumber of OilTempSensor */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x91)) {
            uint8_t i = 0;
            while (oemPartNumberOilTempSensor[i] != '-') {
              i = i + 1;
            }
            uint8_t len = 3+i;
            uint8_t data[len];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x91;
            for(int i=0;i<len;i++)
            {
              data[3+i] = (uint8_t)oemPartNumberOilTempSensor[i];
            }
            BUS_output(data, len);
          } else
              
          /* 0x22 0xF1 0x92 */
          /* Get PartNumber of WaterTempSensor */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x92)) {
            uint8_t i = 0;
            while (oemPartNumberWaterTempSensor[i] != '-') {
              i = i + 1;
            }
            uint8_t len = 3+i;
            uint8_t data[len];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x92;
            for(int i=0;i<len;i++)
            {
              data[3+i] = (uint8_t)oemPartNumberWaterTempSensor[i];
            }
            BUS_output(data, len);

          } else

          /* 0x22 0xF1 0x93 */
          /* set SupplierPartNumber of OilTempSensor */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x93)) {
            uint8_t i = 0;
            while (supplierPartNumberOilTempSensor[i] != '-') {
              i = i + 1;
            }
            uint8_t len = 3+i;
            uint8_t data[len];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x93;
            for(int i=0;i<len;i++)
            {
              data[3+i] = (uint8_t)supplierPartNumberOilTempSensor[i];
            }
            BUS_output(data, len);


          } else

          /* 0x22 0xF1 0x97 */
          /* get Systemname */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x97)) {
            uint8_t i = 0;
            while (Modulename[i] != '-') 
            {
               i = i + 1;
            }
            uint8_t len = 3+i;
            uint8_t data[len];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x97;
            for(int i=0;i<len;i++)
            {
              data[3+i] = (uint8_t)Modulename[i];
            }
            BUS_output(data, len);

          } else

            /* This part should read the coding
            /* 0x22 0x06 0x00 ......*/
            if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x00)) {
                uint8_t data[5];
                data[0] = posResponse;
                data[1] = 0x06;
                data[2] = 0x00;
                data[3] = brandSelector;
                data[4] = NewOilSensorEquipped;
                BUS_output(data, 5);


            } else
            /* 0x22 0x06 0x01 */
            /* This part should get the Debugvalue for the OilTemperature */
            if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x01)) {          
              uint8_t data[4];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x01;
              data[3] = testValue_oilTemperature;
              BUS_output(data, 4);

            } else

            /* 0x22 0x06 0x02 */
            /* This part should get the Debugvalue for the OilLevel */
            if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x02)) {
              uint8_t data[4];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x02;
              data[3] = testValue_oilLevelPercentage;
              BUS_output(data, 4);
            } else
            /* 0x22 0x06 0x03 */
            /* Returns the OilTemperature  in Degree Celsius which is used by the SW*/
            if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x03)) {
              uint8_t data[4];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x03;
              data[3] = oilTemperature;
              BUS_output(data, 4);
            } else
            /* 0x22 0x06 0x04 */
            /* Returns the Oillevel in percent which is used by the SW*/
            if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x04)) {
              uint8_t data[4];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x04;
              data[3] = oilLevelPercentage;
              BUS_output(data, 4);
            } else
            /* 0x22 0x06 0x0A */
            /* get the Brandvalue */
            if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x0A)) {
              uint8_t data[4];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x0A;
              data[3] = brandSelector;
              BUS_output(data, 4);
            } else
            /* 0x22 0x06 0x0B */
            /* get ExtraOutputPin flag*/
            if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x0B)) {
              uint8_t data[4];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x0B;
              data[3] = statusOfExtraOutputPin;
              BUS_output(data, 4);
            } else
            /* 0x22 0x06 0x0C */
            /* get OldSensorNewSensor flag*/
            if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x0C)) {
              uint8_t data[4];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x0C;
              data[3] = NewOilSensorEquipped;
              BUS_output(data, 4);
            } else
            /* 0x22 0x07 0x00 */
            /* get Oiltemperature compare values for OldSensor */
            if ((receive_BT_Array[1] == 0x07) && (receive_BT_Array[2] == 0x00)) {    
              uint8_t i = 0;
              uint8_t tempvar;
              uint8_t sizeOfArr = sizeof(OilTempCompValues) / sizeof(OilTempCompValues[0]);
              uint8_t data[(3+(sizeOfArr*2))];
              data[0] = posResponse;
              data[1] = 0x07;
              data[2] = 0x00;
              
              for (i = 0; i < (sizeOfArr); i+2){
                /* As example testval =         500 == 0x01F4    */
                /* BUS_output((uint8_t*)testval >> 8);         -> 0x01 */
                /* BUS_output((uint8_t*)testval & 0xFF);       -> 0xF4 */
                data[3+i] = (OilTempCompValues[i] >> 8);
                //BUS_output((uint8_t*)tempvar);
                data[4+i] = (OilTempCompValues[i] & 0xFF);
                //BUS_output((uint8_t*)tempvar);
              }
                BUS_output(data, 3+(sizeOfArr*2));
            } else

