tobiaslenz1988/OilLevelTempSensor_GC9A01_3_0_ESP32_S3/uds_statemachine_common.cpp
          /* This part should set the coding
          /* 0x2E 0x06 0x00 0x??......*/
          if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x00)) {
            if ((receive_BT_Array[3] != NULL) && (receive_BT_Array[4] != NULL) && (receive_BT_Array[5] != NULL)) {
              brandSelector = receive_BT_Array[3];
              NewOilSensorEquipped = (bool)receive_BT_Array[4];
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x00;
              BUS_output(data, 3);
            } else {
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x2E;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            }
          } else


          /* This part should set the Debugvalue for the OilTemperature
          /* 0x2E 0x06 0x01 0x??......*/
          if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x01)) {
            uint8_t val = NULL;
            val = receive_BT_Array[3];
            if (val == NULL) {
              uint8_t data[3];
              data[0] = 0x7f;
              data[1] = 0x2E;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            } else {
              testValue_oilTemperature = val;
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x01;
              BUS_output(data, 3);
            }
          } else
          /* This part should set the Debugvalue for the OilLevel
          /* 0x2E 0x06 0x02 0x!! 0x!!  0x!! 0x!! 0x!!......*/
          if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x02)) {
            uint8_t val = NULL;
            val = receive_BT_Array[3];
            if (val == NULL) 
            {
              uint8_t data[3];
              data[0] = 0x7f;
              data[1] = 0x2E;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            } else {
              testValue_oilLevelPercentage = val;
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x02;
              BUS_output(data, 3);
            }
          } else

          /* This part should set brand for the startuplogo
          /* 0x2E 0x06 0x0A 0x!! */
          if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x0A)) {
            uint8_t val = NULL;
            val = receive_BT_Array[3];
            if (val == NULL) {
              uint8_t data[3];
              data[0] = 0x7f;
              data[1] = 0x2e;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            } else {
              if ((val == BRAND_AUDI) || (val == BRAND_VW) || (val == BRAND_CHEVY) || (val == BRAND_DODGE) || (val == BRAND_NISSAN_GTT)|| (val == BRAND_BMW) || (val == BRAND_MERCEDES_OLD)) {
                brandSelector = val;
                preferences.begin(EEPROMNameSpace, false);
                preferences.putUChar("Brand", val);
                preferences.end();

                uint8_t data[3];
                data[0] = posResponse;
                data[1] = 0x06;
                data[2] = 0x0A;
                BUS_output(data, 3);
              } else {
                uint8_t data[3];
                data[0] = 0x7f;
                data[1] = 0x2e;
                data[2] = UDS_NRC_requestOutOfRange;
                BUS_output(data, 3);
              }
            }
          } else

          /* This part should set the value of an Output Pin
          /* 0x2E 0x06 0x0B 0x!! 0x!!  0x!! 0x!! 0x!!......*/
          if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x0B)) {
            uint8_t val = NULL;
            val = receive_BT_Array[3];
            if (val == NULL) {
              uint8_t data[3];
              data[0] = 0x7f;
              data[1] = 0x2e;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            } else {
              statusOfExtraOutputPin = val;
              digitalWrite(OutputPin, statusOfExtraOutputPin);
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x06;
              data[2] = 0x0B;
              BUS_output(data, 3);
            }
          } else
          /* This part should set the OldSensorNewSensor */
          /* 0x2E 0x06 0x0C 0x!!......*/
          if ((receive_BT_Array[1] == 0x06) && (receive_BT_Array[2] == 0x0C)) {
            bool val = NULL;
            val = (bool)receive_BT_Array[3];
            if (val == NULL) {
              uint8_t data[3];
              data[0] = 0x7f;
              data[1] = 0x2e;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            } else {
              if (NewOilSensorEquipped != val) {
                NewOilSensorEquipped = val;
                preferences.begin(EEPROMNameSpace, false);
                preferences.putBool("NewSensorflag", val);
                preferences.end();
              }
                uint8_t data[3];
                data[0] = posResponse;
                data[1] = 0x06;
                data[2] = 0x0C;
                BUS_output(data, 3);
            }
          } else
          /* This part should set the compare values for OilTemperature of old Sensor
          /* 0x2E 0x07 0x00 0x!! 0x!!  0x!! 0x!! 0x!!......*/
          if ((receive_BT_Array[1] == 0x07) && (receive_BT_Array[2] == 0x00)) {
            uint8_t val = NULL;
            val = receive_BT_Array[3];
            if (val == NULL) {
              uint8_t data[3];
              data[0] = 0x7f;
              data[1] = 0x2e;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            } else {
              preferences.begin(EEPROMNameSpace, false);
              uint16_t temp = ((uint16_t)receive_BT_Array[3] << 8) | receive_BT_Array[4];
              preferences.putShort("SENSOR_Temperature_30", temp);
              temp = ((uint16_t)receive_BT_Array[5] << 8) | receive_BT_Array[6];
              preferences.putShort("SENSOR_Temperature_40", temp);
              temp = ((uint16_t)receive_BT_Array[7] << 8) | receive_BT_Array[8];
              preferences.putShort("SENSOR_Temperature_50", temp);
              temp = ((uint16_t)receive_BT_Array[9] << 8) | receive_BT_Array[10];
              preferences.putShort("SENSOR_Temperature_55", temp);
              temp = ((uint16_t)receive_BT_Array[11] << 8) | receive_BT_Array[12];
              preferences.putShort("SENSOR_Temperature_60", temp);
              temp = ((uint16_t)receive_BT_Array[13] << 8) | receive_BT_Array[14];
              preferences.putShort("SENSOR_Temperature_65", temp);
              temp = ((uint16_t)receive_BT_Array[15] << 8) | receive_BT_Array[16];
              preferences.putShort("SENSOR_Temperature_70", temp);
              temp = ((uint16_t)receive_BT_Array[17] << 8) | receive_BT_Array[18];
              preferences.putShort("SENSOR_Temperature_75", temp);
              temp = ((uint16_t)receive_BT_Array[19] << 8) | receive_BT_Array[20];
              preferences.putShort("SENSOR_Temperature_80", temp);
              temp = ((uint16_t)receive_BT_Array[21] << 8) | receive_BT_Array[22];
              preferences.putShort("SENSOR_Temperature_85", temp);
              temp = ((uint16_t)receive_BT_Array[23] << 8) | receive_BT_Array[24];
              preferences.putShort("SENSOR_Temperature_90", temp);
              temp = ((uint16_t)receive_BT_Array[25] << 8) | receive_BT_Array[26];
              preferences.putShort("SENSOR_Temperature_95", temp);
              temp = ((uint16_t)receive_BT_Array[27] << 8) | receive_BT_Array[28];
              preferences.putShort("SENSOR_Temperature_100", temp);
              temp = ((uint16_t)receive_BT_Array[29] << 8) | receive_BT_Array[30];
              preferences.putShort("SENSOR_Temperature_105", temp);
              temp = ((uint16_t)receive_BT_Array[31] << 8) | receive_BT_Array[32];
              preferences.putShort("SENSOR_Temperature_110", temp);
              temp = ((uint16_t)receive_BT_Array[33] << 8) | receive_BT_Array[34];
              preferences.putShort("SENSOR_Temperature_115", temp);
              preferences.end();
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x07;
              data[2] = 0x00;
              BUS_output(data, 3);
            }
          } else
          /* This part should set the compare values for Oillevel old sensor
          /* 0x2E 0x07 0x01 0x!! 0x!!  0x!! 0x!! 0x!!......*/
          if ((receive_BT_Array[1] == 0x07) && (receive_BT_Array[2] == 0x01)) {
            uint8_t val = NULL;
            val = receive_BT_Array[3];
            if (val == NULL) {
              uint8_t data[3];
              data[0] = 0x7f;
              data[1] = 0x2e;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            } else {
              preferences.begin(EEPROMNameSpace, false);
              uint16_t temp = ((uint16_t)receive_BT_Array[3] << 8) | receive_BT_Array[4];
              preferences.putShort("SENSOR_OilLevelEmpty", temp);
              temp = ((uint16_t)receive_BT_Array[5] << 8) | receive_BT_Array[6];
              preferences.putShort("SENSOR_OilLevel_10", temp);
              temp = ((uint16_t)receive_BT_Array[7] << 8) | receive_BT_Array[8];
              preferences.putShort("SENSOR_OilLevel_20", temp);
              temp = ((uint16_t)receive_BT_Array[9] << 8) | receive_BT_Array[10];
              preferences.putShort("SENSOR_OilLevel_30", temp);
              temp = ((uint16_t)receive_BT_Array[11] << 8) | receive_BT_Array[12];
              preferences.putShort("SENSOR_OilLevel_40", temp);
              temp = ((uint16_t)receive_BT_Array[13] << 8) | receive_BT_Array[14];
              preferences.putShort("SENSOR_OilLevel_50", temp);
              temp = ((uint16_t)receive_BT_Array[15] << 8) | receive_BT_Array[16];
              preferences.putShort("SENSOR_OilLevel_60", temp);
              temp = ((uint16_t)receive_BT_Array[17] << 8) | receive_BT_Array[18];
              preferences.putShort("SENSOR_OilLevel_70", temp);
              temp = ((uint16_t)receive_BT_Array[19] << 8) | receive_BT_Array[20];
              preferences.putShort("SENSOR_OilLevel_80", temp);
              temp = ((uint16_t)receive_BT_Array[21] << 8) | receive_BT_Array[22];
              preferences.putShort("SENSOR_OilLevel_90", temp);
              temp = ((uint16_t)receive_BT_Array[23] << 8) | receive_BT_Array[24];
              preferences.putShort("SENSOR_OilLevelFull", temp);

